### Methods of List

In [2]:
a=['samosa','chatni','rolls','patties']
a.append('biryani')
a

['samosa', 'chatni', 'rolls', 'patties', 'biryani']

In [4]:
a.count('biryani')

1

In [6]:
a.index('chatni')

1

In [7]:
a.pop(2)

'rolls'

In [8]:
a

['samosa', 'chatni', 'patties', 'biryani']

In [9]:
a.sort()

In [10]:
a

['biryani', 'chatni', 'patties', 'samosa']

In [15]:
a.reverse()
a

['biryani', 'chatni', 'patties', 'samosa']

In [16]:
a.reverse()
a

['samosa', 'patties', 'chatni', 'biryani']

In [17]:
a.insert(3,'Burger')
a

['samosa', 'patties', 'chatni', 'Burger', 'biryani']

### Methods of Tuple

In [18]:
t=('munir','sagar','karan','sohail')
t.count('munir')

1

In [20]:
t.index('karan')

2

### Methods of Dictionary

In [21]:
d={'Pakistan_Provinces':['Sindh','Punjab','KPK','Balochistan'],'Pakistan_Rivers':['Indus','Chenab','Sutlej','Ravi','Jhelum']}
d.get('Pakistan_Rivers')

['Indus', 'Chenab', 'Sutlej', 'Ravi', 'Jhelum']

In [22]:
d.get('Pakistan_Provinces')

['Sindh', 'Punjab', 'KPK', 'Balochistan']

In [23]:
d.items()

dict_items([('Pakistan_Provinces', ['Sindh', 'Punjab', 'KPK', 'Balochistan']), ('Pakistan_Rivers', ['Indus', 'Chenab', 'Sutlej', 'Ravi', 'Jhelum'])])

In [25]:
d.keys()

dict_keys(['Pakistan_Provinces', 'Pakistan_Rivers'])

## Task 1

In [32]:
# Company team with Permanant employees
t=('Karan','Sagar','Sahil','Ali','Imran')

## Task 2

In [36]:
products={'Brush','Soap','Surf','Daal','Rice','Garam Masala'}
products.add('lal mirch')
products.add('sabz Mirch')
products.add('dhanya')
products.add('tooth paste')
products

{'Brush',
 'Daal',
 'Garam Masala',
 'Rice',
 'Soap',
 'Surf',
 'dhanya',
 'lal mirch',
 'sabz Mirch',
 'tooth paste'}

In [38]:
a=input('enter')

### Class Tasks 29-03-2022

In [2]:
# Q1. Put your favourite song on repeated mode
songs=['saiyyan','Dil ghalti kar betha hai','taray Zameen per']
for i in range(1,10):
    print(songs[2])

taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per
taray Zameen per

In [4]:
# Q2. sum from 1 to 10 by using range function
sum=0
i=1
for i in range(1,11):
    sum=sum+i
    i=i+1
sum

55

In [8]:
# Q3. print a program which counts a value from 1 to 20
i=1
for i in range(1,20):
    i=i+1
i

20

In [35]:
# Q4. write a program for vending machine
t_products=100
while (t_products!=0):
    cust=int(input('Enter the number of products you want: '))
    if cust<=100 and cust>0:
        print('Your Entered Products : ',cust)
        t_products=t_products-cust
        if t_products>0:
            print('Remaining Products = ',t_products)
        else:
            print('Out of Stock')
            break

Your Entered Products :  60
Remaining Products =  40
Your Entered Products :  50
Out of Stock

In [34]:
# Q5. write a program which ask the user how many times you want to run the code
times=int(input('How many times you want to run the code: '))
for times in range(1,times+1):
    print('Code')

Code
Code
Code

### Functions Tasks

#### Task 1

In [37]:
def vending_machine():
    t_products=100
    while (t_products!=0):
        cust=int(input('Enter the number of products you want: '))
        if cust<=100 and cust>0:
            print('Your Entered Products : ',cust)
            t_products=t_products-cust
            if t_products>0:
                print('Remaining Products = ',t_products)
            else:
                print('Out of Stock')
                break
vending_machine()

Your Entered Products :  30
Remaining Products =  70
Your Entered Products :  40
Remaining Products =  30
Your Entered Products :  20
Remaining Products =  10
Your Entered Products :  20
Out of Stock

### Task 2

In [40]:
def f_floor():
    print('Your Flat is at Floor 1')
    print('You will get folowing features in your Flat: ')
    print(' 2 rooms \n 1 Launge \n 1 Kitchen')
def s_floor():
    print('Your Flat is at Floor 2')
    print('You will get folowing features in your Flat: ')
    print(' 3 rooms \n 1 Launge \n 1 Kitchen')
def t_floor():
    print('Your Flat is at Floor 3')
    print('You will get folowing features in your Flat: ')
    print(' 4 rooms \n 1 Launge \n 1 Kitchen')
    
user=int(input('How many rooms you want? max(2/3/4) '))
if user==2:
    f_floor()
if user==3:
    s_floor()
if user==4:
    t_floor()

Your Flat is at Floor 1
You will get folowing features in your Flat:
 2 rooms
 1 Launge
 1 Kitchen

### Task 3

In [45]:
data_base={'19cs49':['Munir','20','19cs49'],'19cs54':['Sagar','19','19cs54'],'19cs87':['Ali','21','19cs87']}
roll_number=input('Enter Roll Number : ')
for i in data_base.keys():
    if roll_number==i:
        print('present')
        break
    else:
        print('not present')
        continue

present

## H.W Tasks

### Task 1

- GameXone offering a new position in their software house, you are selected for an interview. The criteria for selecting your position  either as a programmer or management person is that if you are having 4-5 years of experience in game development than you will be hired as a Developer otherwise they will shortlist your for management.

In [1]:
user_experience=int(input('Enter your Work Experience: '))
if user_experience>=4:
    print('You are selected as Software developer')
if user_experience<=5:
    print('You are hired as Manager')

You are hired as Manager

## Task 2

### Design a career counseling system for students to select their field. 
- You are requested to think like a counsellor who guide students to choose a career according to their interest and passion. If their hobbies , or interest is in arts, drawing , management , suggest them a field of Arts , if they are logical, having expertise and interest in programming , problem solving ,technologies than suggest to pursue their career in Engineering domain .  If they showed their interest in bio , science , discipline and development of humanity than suggest them a medical field.

In [ ]:

word1=['drawing','draw','paint','design','designing']
word2=['logic', 'progiiramming', 'coding', 'problem solving', 'techmnlogies']
word3=['bio', 'science', 'discipline', 'development', 'humanity']
print('''~~~~~~~~~~~~~~~~~~~~~~~~~~~~~''')
print("\t\t--> You are welcome here to write about yourself <--")
print('''~~~~~~~~~~~~~~~~~~~~~~~~~~~~~''')
Your_interset=input("-->> What hobbies do you have or what you like more:\n").casefold()
final=Your_interset.split(" ")
print(final)
for i in range(len(final)):
        if final[i] in word1:
                print("According to your bio, we will suggest to take Art field") 
                break
        elif final[i] in word2:
                print("According to your bio, we will suggest to take Engineering field")
                break
        elif final[i] in word3:
                print("According to your bio, we will suggest to take Bio field")
                break
        else:
                print("Sorry Sir.. ap ko parhna thora sa mushkil hai..!!")
                break

## Task 3

- Design a calculator that takes 2 values from user to apply mathematical operations
Addition , subtraction, division ØŒmultiplication and floor division.

In [ ]:


print("Select operation.")
print("1--------Add")
print("2--------Subtract")
print("3--------Multiply")
print("4--------Divide")
print("5--------floor")
solution=0
while True:
    choice= input("Enter Your Choise (1/2/3/4/5): ")
    if choice in ('1', '2', '3', '4','5'):
        x=eval(input("Enter the first value: "))
        y=eval(input("Enter the second value: "))
        if choice=='1':
            solution=x+y
            print(f"The sum of {x} + {y} = {solution}")
        elif choice=='2':
            solution=x-y
            print(f"The substraction of {x} - {y} = {solution}")
        elif choice=='3':
            solution=x*y
            print(f"The multiplication of {x} x {y} = {solution}")
        elif choice=='4':
            solution=x/y
            print(f"The division of {x} / {y} = {solution}")
        elif choice=='5':
            solution=x//y
            print(f"The floor division of {x} // {y} = {solution}")
        again= input("Do You Want To Perform Another Calculation (y/n): ")
        new_again=again.casefold()
        if new_again=='n':
            break
    else:
        print("Ooops..!! invalid Input")

### Object and classes

- Make a country administration system, which controls all citie's management system like education system, environment, light ,gass and water supply.

In [ ]:
class administration():
    def education_system():
        print('Education System')
    def environment():
        status=input('Enter status of environment: ')
        if status=='clean':
            print('Safe Environment')
        elif status=='not clean':
            print('Not Safe Environment')
    def light():
        print('Lights are on')

### Arrays (31-03-2022)

In [2]:
a=[1,2,3,4,5]
print(type(a))

<class 'list'>

In [3]:
import array as ar

In [10]:
n=ar.array('i',[1,2,3,4,5]) #i is for integer
n

array('i', [1, 2, 3, 4, 5])

In [7]:
print(type(n))

<class 'array.array'>

In [9]:
n=ar.array('f',[1,2,3,4,5])
n

array('f', [1.0, 2.0, 3.0, 4.0, 5.0])

In [11]:
n[1]

2

In [12]:
n[:2]

array('i', [1, 2])

In [13]:
n[1:4]

array('i', [2, 3, 4])

In [14]:
n[2:]

array('i', [3, 4, 5])

##### Install libraries

In [16]:
pip install numpy

Requirement already satisfied: numpy in c:\users\gulmu\appdata\local\programs\python\python310\lib\site-packages (1.22.3)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Users\gulmu\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [17]:
import numpy as np
from numpy import *

In [18]:
n=np.array([1,2,3,4,5])

In [20]:
n.ndim # it will tell us number of dimensions of array

1

2-D Array

In [26]:
n=np.array([[1,2,3,4,5],[6,7,8,9,10]])
n

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [27]:
n.ndim

2

3-D Array

In [34]:
n=np.array([[[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]]])
n

array([[[ 1,  2,  3,  4,  5],
        [ 6,  7,  8,  9, 10],
        [11, 12, 13, 14, 15],
        [16, 17, 18, 19, 20]]])

In [35]:
n.ndim

3

#### Home Work
- Apply 10 methods on an array

In [3]:
pip install numpy

Requirement already satisfied: numpy in c:\users\gulmu\appdata\local\programs\python\python310\lib\site-packages (1.22.3)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Users\gulmu\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

### Pandas

In [4]:
import pandas as pd
#create dataframe from dictionary
dic={'university':['lumhs','muet','sindh'],'degree':['Medical','Engineering','General'],'fees':[30000,32000,18000]}
#dic
d=pd.DataFrame(dic)
d

  university       degree   fees
0      lumhs      Medical  30000
1       muet  Engineering  32000
2      sindh      General  18000

In [13]:
#converting tuple to data frame
dic={'university':('lumhs','muet','sindh'),'degree':('Medical','Engineering','General'),'fees':(30000,32000,18000)}
dic
d=pd.DataFrame(dic)
d

  university       degree   fees
0      lumhs      Medical  30000
1       muet  Engineering  32000
2      sindh      General  18000

In [14]:
# List to dictionary
l=[{'uni':'lumhs','degree':'Medical','fees':30000}]
p=pd.DataFrame(l)
p

     uni   degree   fees
0  lumhs  Medical  30000

In [16]:
# List to dictionary
l=[{'uni':'lumhs','degree':'Medical','fees':30000},{'uni':'muet','degree':'Engineering','fees':32000},{'uni':'sindh','degree':'General','fees':18000}]
p=pd.DataFrame(l)
p

     uni       degree   fees
0  lumhs      Medical  30000
1   muet  Engineering  32000
2  sindh      General  18000

In [17]:
#List to list
li=[[1,2,3,4,5],[6,7,8,9,10]]
lis=pd.DataFrame(li)
lis

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [20]:
lis=pd.DataFrame(li,columns=['name','address','roll_no','tarayzameen','tinradhisht'])
lis

   name  address  roll_no  tarayzameen  tinradhisht
0     1        2        3            4            5
1     6        7        8            9           10

In [5]:
# tuple to tuple
tu=((1,2,3,4,5),(6,7,8,9,10))
tup=pd.DataFrame(tu)
tup

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [6]:
tup=pd.DataFrame(tu,columns=['name','address','roll_no','tarayzameen','tinradhisht'])
tup

   name  address  roll_no  tarayzameen  tinradhisht
0     1        2        3            4            5
1     6        7        8            9           10

#### Slicing the Data Frame

In [7]:
#Slicing the Data
sliced_data=tup.iloc[:,2:4]
print(sliced_data)

   roll_no  tarayzameen
0        3            4
1        8            9

In [8]:
#Slicing the Data
sliced_data=tup.loc[:,'name':'roll_no']
print(sliced_data)

   name  address  roll_no
0     1        2        3
1     6        7        8

### H.W.
- Make 5 examples for all methods
    - Dictionary to List
    - Tuple to Tuple
    - List to List
    - Dictionary to Tuple
    - List to Dictionary

##### Dictionary to List

In [9]:
import pandas as pd
d1={'Countries':['Pakistan','India','Afghanistan','Iran','China'],'Capital City':['Islamabad','Delhi','Kabul','Tehran','Beijing'],'Currency':['Pakistani Rupee','Indian Rupee','Afghani','Iranian Rial','Renminbi']}
dataframe=pd.DataFrame(d1)
dataframe

     Countries Capital City         Currency
0     Pakistan    Islamabad  Pakistani Rupee
1        India        Delhi     Indian Rupee
2  Afghanistan        Kabul          Afghani
3         Iran       Tehran     Iranian Rial
4        China      Beijing         Renminbi

In [11]:
d2={'Processors':['Core i3','Core i5','Core i7'],'Number of Cores':['2 cores','4 cores','6 cores'],'Rate':[10000,15000,20000]}
dataframe1=pd.DataFrame(d2)
dataframe1

  Processors Number of Cores   Rate
0    Core i3         2 cores  10000
1    Core i5         4 cores  15000
2    Core i7         6 cores  20000

In [12]:
d3={'Items':['Chicken Roll','Chatni Roll','Samosa','Zinger','Chicken Burger','Tikka'],'Quantity':[3,4,2,5,1,3],'Rate':[120,100,30,250,150,250],'Price':[360,400,60,1250,150,750]}
dataframe2=pd.DataFrame(d3)
dataframe2

            Items  Quantity  Rate  Price
0    Chicken Roll         3   120    360
1     Chatni Roll         4   100    400
2          Samosa         2    30     60
3          Zinger         5   250   1250
4  Chicken Burger         1   150    150
5           Tikka         3   250    750

In [15]:
d4={'Items':['Pant','Shirt','Socks','Belt','Cap'],'Brand':['Levis','Dockers','Calvin Klein','versace','Stetson'],'Rate':[1500,1000,300,2000,800]}
dataframe4=pd.DataFrame(d4)
dataframe4

   Items         Brand  Rate
0   Pant         Levis  1500
1  Shirt       Dockers  1000
2  Socks  Calvin Klein   300
3   Belt       versace  2000
4    Cap       Stetson   800

List to Dictionary

In [16]:
list=[{'Rivers':'Ravi','Provinces':'Punjab'},{'Rivers':'Chenab','Provinces':'Sindh'},{'Rivers':'Sutlej','Provinces':'Balochistan'},{'Rivers':'Jhelum','Provinces':'KPK'},{'Rivers':'Indus','Provinces':'Gilgit Baltistan'}]
dataframe5=pd.DataFrame(list)
dataframe5

   Rivers         Provinces
0    Ravi            Punjab
1  Chenab             Sindh
2  Sutlej       Balochistan
3  Jhelum               KPK
4   Indus  Gilgit Baltistan

In [18]:
list1=[{'Continents':'Asia','Area (km2)':'31,033,131'},{'Continents':'Africa','Area (km2)':'29,648,481'},{'Continents':'Oceania','Area (km2)':'8,486,460'},{'Continents':'Antarctica','Area (km2)':'13,720,000'},{'Continents':'South America','Area (km2)':'17,461,112'},{'Continents':'North America','Area (km2)':'21,330,000'},{'Continents':'Europe','Area (km2)':'22,134,900'}]
dataframe6=pd.DataFrame(list1)
dataframe6

      Continents  Area (km2)
0           Asia  31,033,131
1         Africa  29,648,481
2        Oceania   8,486,460
3     Antarctica  13,720,000
4  South America  17,461,112
5  North America  21,330,000
6         Europe  22,134,900

In [19]:
list2=[{'Organization':'United Nation Organization','Abbreviation':'UNO','Head Quarters':'New York'},{'Organization':'United Nation Children Fund','Abbreviation':'UNICEF','Head Quarters':'New York'},{'Organization':'World Health Organization','Abbreviation':'WHO','Head Quarters':'Geneva'},{'Organization':'International Atomic Energy Agency','Abbreviation':'IAEA','Head Quarters':'Vienna'}]
dataframe7=pd.DataFrame(list2)
dataframe7

                         Organization Abbreviation Head Quarters
0          United Nation Organization          UNO      New York
1         United Nation Children Fund       UNICEF      New York
2           World Health Organization          WHO        Geneva
3  International Atomic Energy Agency         IAEA        Vienna

In [20]:
list3=[{'Party':'PTI','Votes':223000},{'Party':'PML(N)','Votes':189000},{'Party':'PPP','Votes':156700}]
dataframe8=pd.DataFrame(list3)
dataframe8

    Party   Votes
0     PTI  223000
1  PML(N)  189000
2     PPP  156700

Tuple to Tuple

In [23]:
tup=(('Gul Munir','19cs49','CSE','Thatta'),('Sagar Kumar','19cs54','CSE','Khairpur'),('Karan Kumar','19cs55','CSE','Khairpur'))
dataframe9=pd.DataFrame(tup,columns=['Name','Roll Number','Department','District'])
dataframe9

          Name Roll Number Department  District
0    Gul Munir      19cs49        CSE    Thatta
1  Sagar Kumar      19cs54        CSE  Khairpur
2  Karan Kumar      19cs55        CSE  Khairpur

In [29]:
tup1=(('Pant','Levis','1500'),('Shirt','Dockers','1000'),('Socks','Calvin Klein','300'),('Cap','Santso','800'))
dataframe10=pd.DataFrame(tup1, columns=['Item','Brand','Rate'])
dataframe10

    Item         Brand  Rate
0   Pant         Levis  1500
1  Shirt       Dockers  1000
2  Socks  Calvin Klein   300
3    Cap        Santso   800

In [31]:
tup2=(('core i5','7th Gen',20000),('core i5','8th Gen',23000),('core i5','10th Gen',27000))
dataframe11=pd.DataFrame(tup2,columns=['Processors','Generations','Rate'])
dataframe11

  Processors Generations   Rate
0    core i5     7th Gen  20000
1    core i5     8th Gen  23000
2    core i5    10th Gen  27000

In [33]:
tup3=(('Book 1','Sagar','Noori Publishers',2015),('Book 2','Karan','Naseem Publishers',2018),('Book 3','Ali','Khipro Publishers',2019))
dataframe12=pd.DataFrame(tup3,columns=['Book Name','Author Name','Publisher Name','year'])
dataframe12

  Book Name Author Name     Publisher Name  year
0    Book 1       Sagar   Noori Publishers  2015
1    Book 2       Karan  Naseem Publishers  2018
2    Book 3         Ali  Khipro Publishers  2019

List to List

In [36]:
list1=[['Gul Munir','19cs49','CSE','Thatta'],['Sagar Kumar','19cs54','CSE','Khairpur'],['Karan Kumar','19cs55','CSE','Khairpur']]
dataframe13=pd.DataFrame(list1,columns=['Name','Roll Number','Department','District'])
dataframe13

          Name Roll Number Department  District
0    Gul Munir      19cs49        CSE    Thatta
1  Sagar Kumar      19cs54        CSE  Khairpur
2  Karan Kumar      19cs55        CSE  Khairpur

In [37]:
list2=[['Pant','Levis','1500'],['Shirt','Dockers','1000'],['Socks','Calvin Klein','300'],['Cap','Santso','800']]
dataframe14=pd.DataFrame(list2, columns=['Item','Brand','Rate'])
dataframe14

    Item         Brand  Rate
0   Pant         Levis  1500
1  Shirt       Dockers  1000
2  Socks  Calvin Klein   300
3    Cap        Santso   800

In [38]:
list3=[['core i5','7th Gen',20000],['core i5','8th Gen',23000],['core i5','10th Gen',27000]]
dataframe15=pd.DataFrame(list3,columns=['Processors','Generations','Rate'])
dataframe15

  Processors Generations   Rate
0    core i5     7th Gen  20000
1    core i5     8th Gen  23000
2    core i5    10th Gen  27000

In [39]:
list4=[['Book 1','Sagar','Noori Publishers',2015],['Book 2','Karan','Naseem Publishers',2018],['Book 3','Ali','Khipro Publishers',2019]]
dataframe16=pd.DataFrame(list4,columns=['Book Name','Author Name','Publisher Name','year'])
dataframe16

  Book Name Author Name     Publisher Name  year
0    Book 1       Sagar   Noori Publishers  2015
1    Book 2       Karan  Naseem Publishers  2018
2    Book 3         Ali  Khipro Publishers  2019

Dictionary to Tuple

In [40]:
dic1={'Countries':('Pakistan','India','Afghanistan','Iran','China'),'Capital City':('Islamabad','Delhi','Kabul','Tehran','Beijing'),'Currency':('Pakistani Rupee','Indian Rupee','Afghani','Iranian Rial','Renminbi')}
dataframe17=pd.DataFrame(dic1)
dataframe17

     Countries Capital City         Currency
0     Pakistan    Islamabad  Pakistani Rupee
1        India        Delhi     Indian Rupee
2  Afghanistan        Kabul          Afghani
3         Iran       Tehran     Iranian Rial
4        China      Beijing         Renminbi

In [41]:
dic2={'Processors':('Core i3','Core i5','Core i7'),'Number of Cores':('2 cores','4 cores','6 cores'),'Rate':(10000,15000,20000)}
dataframe18=pd.DataFrame(dic2)
dataframe18

  Processors Number of Cores   Rate
0    Core i3         2 cores  10000
1    Core i5         4 cores  15000
2    Core i7         6 cores  20000

In [42]:
dic3={'Items':('Chicken Roll','Chatni Roll','Samosa','Zinger','Chicken Burger','Tikka'),'Quantity':(3,4,2,5,1,3),'Rate':(120,100,30,250,150,250),'Price':(360,400,60,1250,150,750)}
dataframe2=pd.DataFrame(d3)
dataframe2

            Items  Quantity  Rate  Price
0    Chicken Roll         3   120    360
1     Chatni Roll         4   100    400
2          Samosa         2    30     60
3          Zinger         5   250   1250
4  Chicken Burger         1   150    150
5           Tikka         3   250    750

In [1]:
import pandas as pd

In [2]:
file=pd.to_csv('munir.csv')

AttributeError: module 'pandas' has no attribute 'to_csv'

In [43]:
dic4={'Items':('Pant','Shirt','Socks','Belt','Cap'),'Brand':('Levis','Dockers','Calvin Klein','versace','Stetson'),'Rate':(1500,1000,300,2000,800)}
dataframe4=pd.DataFrame(dic4)
dataframe4

   Items         Brand  Rate
0   Pant         Levis  1500
1  Shirt       Dockers  1000
2  Socks  Calvin Klein   300
3   Belt       versace  2000
4    Cap       Stetson   800

### EDA on Data set of Self Driving Car

In [1]:
import pandas as pd

In [2]:
obs_by_asset = train.groupby(['investment_id'])['target'].count()

fig, ax = plt.subplots(1, 1, figsize=(12, 6))
obs_by_asset.plot.hist(bins=60)
plt.title("target by asset distribution")
plt.show()

NameError: name 'train' is not defined